Revit 2024 API
FabricationPart.ProductListEntry Property
 The product entry index of the fabrication part. A value of -1 indicates the fabrication part is not a product list.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016 Subscription Release
Syntax
C#
public int ProductListEntry { get; set; }
Visual Basic
Public Property ProductListEntry As Integer
	Get
	Set
Visual C++
public:
property int ProductListEntry {
	int get ();
	void set (int value);
}
Remarks
 The product list is a catalog of available sizes for the part and the index refers to the entry on this list.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: modifying the product entry will cause the dimensions of connected ends to change.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The product entry index is not larger than 0 and less than GetProductCount.
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: -or- When setting this property: the product entry fails to be set by index: productEntryIndex.
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace